Repository: CofficLab/GitOK
Catalog: Packages/PluginGitCommitStyleSettings/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Choose Conventional Commits or a custom style.
zh_hans: 选择 Conventional Commits 或自定义风格。
zh_hk: 選擇 Conventional Commits 或自定義風格。

source: Choosing a different style changes how commit messages are displayed:
zh_hans: 选择不同的风格会改变提交信息的显示方式：
zh_hk: 選擇不同的風格會改變提交訊息的顯示方式：

source: Commit Style
zh_hans: 提交风格
zh_hk: 提交風格

source: Commit cleanly
zh_hans: 整洁提交
zh_hk: 整潔提交

source: Core Capabilities
zh_hans: 核心能力
zh_hk: 核心能力

source: Default commit message display style for new projects
zh_hans: 新项目的默认提交信息显示风格
zh_hk: 新專案的預設提交訊息顯示風格

source: Define subject and body templates for the commit form.
zh_hans: 为提交表单定义主题与正文模板。
zh_hk: 為提交表單定義主題與正文模板。

source: Emoji Style
zh_hans: Emoji 风格
zh_hk: Emoji 風格

source: Global Default Style
zh_hans: 全局默认风格
zh_hk: 全域預設風格

source: Guides
zh_hans: 引导
zh_hk: 引導

source: How It Works
zh_hans: 工作原理
zh_hk: 工作原理

source: Live Guidance
zh_hans: 实时引导
zh_hk: 實時引導

source: Message Templates
zh_hans: 消息模板
zh_hk: 消息模板

source: Messages follow the style without friction.
zh_hans: 消息无摩擦地遵循风格。
zh_hk: 消息無摩擦地遵循風格。

source: Pick a style
zh_hans: 选择风格
zh_hk: 選擇風格

source: Plain Text Lowercase
zh_hans: 纯文本小写
zh_hk: 純文字小寫

source: Plain Text Style
zh_hans: 纯文本风格
zh_hk: 純文字風格

source: Set the convention for the repository.
zh_hans: 为仓库设定提交规范。
zh_hk: 為倉庫設定提交規範。

source: Shape the form
zh_hans: 塑造表单
zh_hk: 塑造表單

source: Style Examples
zh_hans: 风格示例
zh_hk: 風格範例

source: Style Presets
zh_hans: 风格预设
zh_hk: 風格預設

source: Templates
zh_hans: 模板
zh_hk: 模板

source: Templates guide subject, body, and trailers.
zh_hans: 模板引导主题、正文与尾注。
zh_hk: 模板引導主題、正文與尾註。

source: The form nudges messages toward the chosen style.
zh_hans: 表单引导消息贴合所选风格。
zh_hk: 表單引導消息貼合所選風格。

source: Your repository's commit style, enforced consistently.
zh_hans: 仓库的提交风格，保持一致。
zh_hk: 倉庫的提交風格，保持一致。

source: guidance
zh_hans: 引导
zh_hk: 引導

source: style per repo
zh_hans: 每仓库一种风格
zh_hk: 每倉庫一種風格
